000_РОЗНИЦА_ЦЕНТР/src/Reports/АктАннулированныхТоваров/АктАннулированныхТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АктАннулированныхТоваров</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Report>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/АннуляцияПродажи/АннуляцияПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АннуляцияПродажи</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </resources>
  <resources>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </resources>
  <resources>
    <name>СтатусЧекаККМ</name>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </resources>
  <resources>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Администратор</name>
    <comment>Признак наличия роли &quot;Администраторсистемы&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСтруктуры</name>
    <type>
      <types>CatalogRef.СтруктураУзлов</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Индекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КассыККМ/КассыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КассыККМ</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяФормаЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВМагазине</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьКодQR</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьЧековНаПринтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ПРРО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКассы</name>
    <type>
      <types>EnumRef.ТипыКассККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекаККМ</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЛенты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Reports/АктАннулированныхТоваров/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиОсновныхсобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Отчет.НачалоПериода    = ТекущаяДата();
	Отчет.ОкончаниеПериода = ТекущаяДата();

	Если Отчет.Магазин.Пустая() Тогда

		Отчет.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;

	КонецЕсли;

//	а вдруг все реквизиты указаны?
	ЗаполнитьСписокПродавцов();

КонецПроцедуры
	
#КонецОбласти

&НаСервере
Процедура СформироватьАктАннуляцииНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Отчет");
	ОбработкаОбъект.СформироватьАктАннуляции(ТабличныйДокумент);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьАктАннуляции(Команда)

	Если ПроверитьЗаполнение() Тогда

		СформироватьАктАннуляцииНаСервере();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)

	ЗаполнитьСписокПродавцов();

КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПериодаПриИзменении(Элемент)

	ЗаполнитьСписокПродавцов();

КонецПроцедуры

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)

	Отчет.КассаККМ = Неопределено;
	Отчет.Продавец = Неопределено;
	ЗаполнитьСписокПродавцов();

КонецПроцедуры

&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)

	Отчет.Продавец = Неопределено;
	ЗаполнитьСписокПродавцов();

КонецПроцедуры

#Область ПоддержкаФункционалаФормы

&НаСервере
Процедура ЗаполнитьСписокПродавцов()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АннуляцияПродажи.Продавец КАК Продавец
	|ИЗ
	|	РегистрСведений.АннуляцияПродажи КАК АннуляцияПродажи
	|ГДЕ
	|	АннуляцияПродажи.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&ОкончаниеПериода, ДЕНЬ)
	|	И АннуляцияПродажи.Магазин = &Магазин
	|	И ВЫБОР
	|			КОГДА &КассаККМ = ЗНАЧЕНИЕ(Справочник.КассыККМ.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ АннуляцияПродажи.КассаККМ = &КассаККМ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Продавец"
	);
	Запрос.УстановитьПараметр("НачалоПериода"   , Отчет.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", Отчет.ОкончаниеПериода);
	Запрос.УстановитьПараметр("Магазин"         , Отчет.Магазин);
	Запрос.УстановитьПараметр("КассаККМ"        , Отчет.КассаККМ);
	
	Элементы.Продавец.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Продавец"));

КонецПроцедуры

#КонецОбласти
